import React from 'react';

const Statement = () => {
  return (
    <main className="statement">
      <p>
        最初のウェブブラウザは、1991年にティム・バーナーズ＝リーによって公開された。文字を表示しリンクを辿るだけだったウェブブラウザは、1992年には画像を表示できるようになり、その後どんどん多機能化。1995年にはMicroSoftがInternet Explorer（以下IE）を開発し、これがブラウザ戦争の引き金になった。
      </p>
      <br/>
      <p>
        2001年に公開されたIE6.0は、市場シェアのほぼすべてを独占するに至り、一旦はブラウザ戦争を終結させた。しかし、その後の開発の停滞、セキュリティホールの発見、Chrome・Firefox、Safariをはじめとするモダンブラウザの登場などにより、IEは徐々にシェアを落としていき、現在では最新版のIE 11.0ですら、シェア率は1%前後となっている。Web開発の現場ではもう既にIEのことは考慮しないのが普通であり、有名なサイトでもIEでアクセスした際はブラウザを変えるよう促すのが当たり前だが、それはそれとして、未だにIEを使い続けているユーザがいるのもまた事実である。
      </p>
      <br/>
      <p>
        IEと現在主に使われているブラウザ達との間には、大きな壁がある。それは技術の壁であり、ユーザ同士の壁であり、時代の壁でもある。壁の向こう側からこちらの世界を見ようとすると、一体何が見えるのだろうか。ぜひ一度、自分の目で確かめてみて欲しい。
      </p>
    </main>
  );
}

export default Statement;
